In [19]:
import numpy as np
import warnings
warnings.filterwarnings('ignore')
import pandas as pd

In [20]:
pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\users\lenovo\appdata\roaming\python\python311\site-packages (2.1.3)
Requirement already satisfied: numpy<2,>=1.23.2 in c:\users\lenovo\appdata\roaming\python\python311\site-packages (from pandas) (1.26.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\lenovo\appdata\roaming\python\python311\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\lenovo\appdata\roaming\python\python311\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\lenovo\appdata\roaming\python\python311\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\lenovo\appdata\roaming\python\python311\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.1.2 -> 23.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [21]:
pip install numpy

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: numpy in c:\users\lenovo\appdata\roaming\python\python311\site-packages (1.26.2)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.1.2 -> 23.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [22]:
df = pd.read_csv('../input/daal_file.csv')
df

,CDB ID,OSC Account Name,Country Name,FY24 DAAL Account name (or Subsidiary),FY24 Account Segmentation,DAAL NB,DAAL RB
0,7425027,1976,PE,1976,Longtail,1976,1976
1,523314,37135,DO,37135,Longtail,37135,37135
2,1080194,44988,AR,44988,Longtail,44258,44258
3,7561885,50624412411,CR,50624412411,Longtail,50624412411,50624412411
4,7434745,"ALLIANZ TECHNOLOGY OF AMERICA, INC.",US,"ALLIANZ TECHNOLOGY OF AMERICA, INC.",Segment 2,ALLIANZ,ALLIANZ
...,...,...,...,...,...,...,...
229648,595924,WYCHAVON DISTRICT COUNCIL,GB,WYCHAVON DISTRICT COUNCIL,Segment 4,UKI COUNCIL,UKI COUNCIL
229649,1316172,WYCOMBE DISTRICT COUNCIL,GB,WYCOMBE DISTRICT COUNCIL,Segment 4,UKI COUNCIL,UKI COUNCIL
229650,1473192,WYRE BOROUGH COUNCIL,GB,WYRE BOROUGH COUNCIL,Segment 4,UKI COUNCIL,UKI COUNCIL
229651,956771,WYRE FOREST DISTRICT COUNCIL,GB,WYRE FOREST DISTRICT COUNCIL,Segment 4,UKI COUNCIL,UKI COUNCIL
229652,6759351,WYRE FOREST DISTRICT COUNCIL,GB,WYRE FOREST DISTRICT COUNCIL,Segment 4,UKI COUNCIL,UKI COUNCIL

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 229653 entries, 0 to 229652
Data columns (total 7 columns):
 #   Column                                  Non-Null Count   Dtype
---  ------                                  --------------   -----
 0   CDB ID                                  226036 non-null  object
 1   OSC Account Name                        229653 non-null  object
 2   Country Name                            229518 non-null  object
 3   FY24 DAAL Account name (or Subsidiary)  229653 non-null  object
 4   FY24 Account Segmentation               229653 non-null  object
 5   DAAL NB                                 229653 non-null  object
 6   DAAL RB                                 229653 non-null  object
dtypes: object(7)
memory usage: 12.3+ MB

In [24]:
# Drop multiple columns in place
columns_to_drop = ['FY24 DAAL Account name (or Subsidiary)', 'DAAL RB']

df.drop(columns_to_drop, axis=1, inplace=True)

In [25]:
df

,CDB ID,OSC Account Name,Country Name,FY24 Account Segmentation,DAAL NB
0,7425027,1976,PE,Longtail,1976
1,523314,37135,DO,Longtail,37135
2,1080194,44988,AR,Longtail,44258
3,7561885,50624412411,CR,Longtail,50624412411
4,7434745,"ALLIANZ TECHNOLOGY OF AMERICA, INC.",US,Segment 2,ALLIANZ
...,...,...,...,...,...
229648,595924,WYCHAVON DISTRICT COUNCIL,GB,Segment 4,UKI COUNCIL
229649,1316172,WYCOMBE DISTRICT COUNCIL,GB,Segment 4,UKI COUNCIL
229650,1473192,WYRE BOROUGH COUNCIL,GB,Segment 4,UKI COUNCIL
229651,956771,WYRE FOREST DISTRICT COUNCIL,GB,Segment 4,UKI COUNCIL
229652,6759351,WYRE FOREST DISTRICT COUNCIL,GB,Segment 4,UKI COUNCIL

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 229653 entries, 0 to 229652
Data columns (total 5 columns):
 #   Column                     Non-Null Count   Dtype
---  ------                     --------------   -----
 0   CDB ID                     226036 non-null  object
 1   OSC Account Name           229653 non-null  object
 2   Country Name               229518 non-null  object
 3   FY24 Account Segmentation  229653 non-null  object
 4   DAAL NB                    229653 non-null  object
dtypes: object(5)
memory usage: 8.8+ MB

#FIND DUPLICATE ROWS AND DROP DUPLICATE ROWS

In [27]:
df.shape

(229653, 5)

In [28]:
# Check for duplicate rows without considering the 'CDB ID' column
columns_to_check = ['OSC Account Name', 'Country Name', 'FY24 Account Segmentation', 'DAAL NB']
duplicate_rows = df.duplicated(subset=columns_to_check, keep='first')

# Count the number of duplicate rows
num_duplicates = duplicate_rows.sum()

print(f"Number of duplicate rows: {num_duplicates}")

Number of duplicate rows: 95373

In [29]:
# Filter and print the duplicate rows
duplicate_df = df[duplicate_rows]
print("Duplicate rows without considering 'CDB ID' column:")
duplicate_df

Duplicate rows without considering 'CDB ID' column:

,CDB ID,OSC Account Name,Country Name,FY24 Account Segmentation,DAAL NB
25,1194760,: FONDO DE SOLIDARIDAD E INVERSION SOCIAL,CL,Longtail,FONDO DE SOLIDARIDAD E INVERSION SOCIAL
29,281261,1 ACOS,US,Segment 1,USAF
33,1525067,1001-BDI DIVISION OF BELL MOBILITY,CA,Segment 1,BELL CANADA
34,80219,1001-BDI DIVISION OF BELL MOBILITY,CA,Segment 1,BELL CANADA
39,272584,1010 DATA INC,US,Longtail,1010 DATA INC
...,...,...,...,...,...
229638,698324,WELWYN HATFIELD COUNCIL,GB,Segment 4,UKI COUNCIL
229639,286635,WELWYN HATFIELD COUNCIL,GB,Segment 4,UKI COUNCIL
229647,647359,WYCHAVON DISTRICT COUNCIL,GB,Segment 4,UKI COUNCIL
229648,595924,WYCHAVON DISTRICT COUNCIL,GB,Segment 4,UKI COUNCIL
229652,6759351,WYRE FOREST DISTRICT COUNCIL,GB,Segment 4,UKI COUNCIL

In [30]:
# Drop duplicated rows keeping the first occurrence without considering first column
columns_to_check = ['OSC Account Name', 'Country Name', 'FY24 Account Segmentation', 'DAAL NB']

df = df.drop_duplicates(subset=columns_to_check, keep='first')

In [31]:
df.shape

(134280, 5)

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 134280 entries, 0 to 229651
Data columns (total 5 columns):
 #   Column                     Non-Null Count   Dtype
---  ------                     --------------   -----
 0   CDB ID                     130666 non-null  object
 1   OSC Account Name           134280 non-null  object
 2   Country Name               134227 non-null  object
 3   FY24 Account Segmentation  134280 non-null  object
 4   DAAL NB                    134280 non-null  object
dtypes: object(5)
memory usage: 6.1+ MB

In [33]:
# Print rows with null values in the 'CDB ID' column
rows_with_null_cdb_id = df[df['CDB ID'].isnull()]
print("Rows with null 'CDB ID':")
rows_with_null_cdb_id

Rows with null 'CDB ID':

,CDB ID,OSC Account Name,Country Name,FY24 Account Segmentation,DAAL NB
152013,NaN,A. Kayser GmbH & Co. KG Textile Filtermedien,DE,Segment 3,A. KAYSER GMBH & CO. KG TEXTILE FILTERMEDIEN
152042,NaN,ALB SCHWEIZ AG,CH,Segment 3,ABB
152043,NaN,Abraxas Informatik AG,CH,Longtail,ABRAXAS INFORMATIK AG
152087,NaN,AIRBUS OPERATIONS GMBH Airbus Operations GmbH,DE,Segment 2,AIRBUS
152155,NaN,ALBA EUROPE,DE,Segment 3,ALBA EUROPE
...,...,...,...,...,...
224651,NaN,STATE STREET GLOBAL ADVISERS UK LTD,GB,Segment 5,STATE STREET CORP
224652,NaN,STATE STREET SERVICES (JERSEY) LTD,GB,Segment 5,STATE STREET CORP
224653,NaN,STATE STREET SERVICES LTD,GB,Segment 5,STATE STREET CORP
224654,NaN,STATE STREET TRUSTEES LTD,GB,Segment 5,STATE STREET CORP
229415,NaN,Biotechnology and Biological Sciences Research...,GB,Segment 4,UKI COUNCIL

In [34]:
# Print rows with null values in the 'Country name' column
rows_with_null_country_name = df[df['Country Name'].isnull()]
print("Rows with null 'Country Name':")
print(rows_with_null_country_name)

print("Number of rows with null country name: ", len(rows_with_null_country_name))

Rows with null 'Country Name':
         CDB ID                                   OSC Account Name  \
131275  7583630          TRIBUNAL REGIONAL DO TRABALHO DA 5 REGIAO
131276  7583631         TRIBUNAL REGIONAL DO TRABALHO DA 19 REGIAO
131277  7583645         TRIBUNAL REGIONAL DO TRABALHO DA 22 REGIAO
131278  7583649         TRIBUNAL REGIONAL DO TRABALHO DA 16 REGIAO
131279  7583653         TRIBUNAL REGIONAL DO TRABALHO DA 20 REGIAO
131280  7530214                             VS SERVICE COMPANY LLC
131281  7587678                                     ATRIUS MSO LLC
131284  1361841                                           WWT - TB
131285  6755471                             WWT TELCOBUY WAREHOUSE
131286  7542219                                                WWT
131287  7578324                                             SPACEX
131288   373080          WILLIAM MORRIS ENDEAVOR ENTERTAINMENT LLC
131289   526807                          LIVE NATION WORLDWIDE INC
131290  1404056                                 LIVE NATION UK LTD
131291    10803                                    LIVE NATION INC
131292   526808                            LIVE NATION MERCHANDISE
131293  2349266                          LIVE NATION ENTERTAINMENT
131295   322621                                        LIVE NATION
131299   230514                                          GREEN DOT
131300   577848                                     GREEN DOT CORP
198435   318129                                   BANK OF BOTSWANA
198510  7446627                                     MOZA BANCO S.A
198525  2430400                              STANBIC BANK BOTSWANA
198555    61473                          STANBIC BANK BOTSWANA LTD
198570    61475                            STANBIC BANK ZAMBIA LTD
198615  7455333                              STANBIC BANK ZIMBABWE
198675  7562745                                   STANBIC ESWATINI
198705  7471636                            STANDARD BANK DE ANGOLA
198765  2427828                               STANDARD BANK MALAWI
198825  5877555                    STANDARD BANK MAURITIUS LIMITED
198855  1557940                           STANDARD BANK MOZAMBIQUE
198870  7298962                              STANDARD BANK NAMIBIA
198900  6861539                      STANDARD BANK SARL MOZAMBIQUE
198930  7455456                            STANDARD BANK SWAZILAND
198960  7415545                              STANDARD LESOTHO BANK
199135      NaN                                        Axian Group
199162   266605                       Central Bank of Zimbabwe CBZ
199189  1091726                          DEBSWANA CORPORATE CENTER
199216  2421974                                DEBSWANA DIAMOND CO
199270  2596249                           GOVERNMENT ONLINE CENTER
199648  2555079                          MAURITIUS COMMERCIAL BANK
199891  2429403  MAURITIUS COMMERCIAL BANK CONSULTING SERVICES LTD
199945  2640146                     MAURITIUS COMMERCIAL BANK ICPS
199999  2557129                      MAURITIUS COMMERCIAL BANK LTD
200296      NaN  MAURITIUS COMMERCIAL BANK Mauritius Commercial...
200323   577096                  THE MAURITIUS COMMERCIAL BANK LTD
200485  2633433  THE MAURITIUS COMMERCIAL BANK LTD Mauritius Co...
200539   319214                                              Telma
200593  1039568                   BFA BANCO DE FOMENTO ANGOLA SARL
200736  4267076                                      MTN SWAZILAND
200862  1557675              MTN SWAZILAND MTN SOUTH SUDAN LIMITED
200876  1351207                                         MTN ZAMBIA
207073  7567955                                       MTN ESWATINI

       Country Name FY24 Account Segmentation  \
131275          NaN                 Segment 3
131276          NaN                 Segment 3
131277          NaN                 Segment 3
131278          NaN                 Segment 3
131279          NaN                 Segment 3
131280          NaN                 Segment 3
131281          NaN                 Segment 1
131284          NaN                 Segment 3
131285          NaN                 Segment 3
131286          NaN                 Segment 3
131287          NaN                 Segment 3
131288          NaN                 Segment 3
131289          NaN                 Segment 3
131290          NaN                 Segment 3
131291          NaN                 Segment 3
131292          NaN                 Segment 3
131293          NaN                 Segment 3
131295          NaN                 Segment 3
131299          NaN                 Segment 3
131300          NaN                 Segment 3
198435          NaN                 Segment 1
198510          NaN                 Segment 1
198525          NaN                 Segment 1
198555          NaN                 Segment 1
198570          NaN                 Segment 1
198615          NaN                 Segment 1
198675          NaN                 Segment 1
198705          NaN                 Segment 1
198765          NaN                 Segment 1
198825          NaN                 Segment 1
198855          NaN                 Segment 1
198870          NaN                 Segment 1
198900          NaN                 Segment 1
198930          NaN                 Segment 1
198960          NaN                 Segment 1
199135          NaN                 Segment 3
199162          NaN                 Segment 3
199189          NaN                 Segment 3
199216          NaN                 Segment 3
199270          NaN                 Segment 3
199648          NaN                 Segment 3
199891          NaN                 Segment 3
199945          NaN                 Segment 3
199999          NaN                 Segment 3
200296          NaN                 Segment 3
200323          NaN                 Segment 3
200485          NaN                 Segment 3
200539          NaN                 Segment 3
200593          NaN                 Segment 3
200736          NaN                 Segment 1
200862          NaN                 Segment 1
200876          NaN                 Segment 1
207073          NaN                 Segment 1

                                      DAAL NB
131275          TRIBUNAL SUPERIOR DO TRABALHO
131276          TRIBUNAL SUPERIOR DO TRABALHO
131277          TRIBUNAL SUPERIOR DO TRABALHO
131278          TRIBUNAL SUPERIOR DO TRABALHO
131279          TRIBUNAL SUPERIOR DO TRABALHO
131280                       VICTORIAS SECRET
131281                     UNITEDHEALTH GROUP
131284                  WORLD WIDE TECHNOLOGY
131285                 WWT TELCOBUY WAREHOUSE
131286                  WORLD WIDE TECHNOLOGY
131287                                 SPACEX
131288  WILLIAM MORRIS ENDEAVOR ENTERTAINMENT
131289              LIVE NATION ENTERTAINMENT
131290              LIVE NATION ENTERTAINMENT
131291              LIVE NATION ENTERTAINMENT
131292              LIVE NATION ENTERTAINMENT
131293              LIVE NATION ENTERTAINMENT
131295              LIVE NATION ENTERTAINMENT
131299                              GREEN DOT
131300                              GREEN DOT
198435                 STANDARD BANK CA + IOI
198510                 STANDARD BANK CA + IOI
198525                 STANDARD BANK CA + IOI
198555                 STANDARD BANK CA + IOI
198570                 STANDARD BANK CA + IOI
198615                 STANDARD BANK CA + IOI
198675                 STANDARD BANK CA + IOI
198705                 STANDARD BANK CA + IOI
198765                 STANDARD BANK CA + IOI
198825                 STANDARD BANK CA + IOI
198855                 STANDARD BANK CA + IOI
198870                 STANDARD BANK CA + IOI
198900                 STANDARD BANK CA + IOI
198930                 STANDARD BANK CA + IOI
198960                 STANDARD BANK CA + IOI
199135                            AXIAN GROUP
199162           CENTRAL BANK OF ZIMBABWE CBZ
199189              DEBSWANA CORPORATE CENTER
199216                    DEBSWANA DIAMOND CO
199270               GOVERNMENT ONLINE CENTRE
199648                              MCB GROUP
199891                              MCB GROUP
199945                              MCB GROUP
199999                              MCB GROUP
200296                              MCB GROUP
200323                              MCB GROUP
200485                              MCB GROUP
200539                                  TELMA
200593                        UNITEL - ANGOLA
200736                      MTN GROUP ESA IOI
200862                      MTN GROUP ESA IOI
200876                      MTN GROUP ESA IOI
207073                      MTN GROUP ESA IOI
Number of rows with null country name:  53

In [35]:
# Drop rows with null values in the "country" column
df = df.dropna(subset=['Country Name'])

In [36]:
# Find null values
df.isnull().sum()

CDB ID                       3612
OSC Account Name                0
Country Name                    0
FY24 Account Segmentation       0
DAAL NB                         0
dtype: int64

## Remove White Space Characters:
### To remove white space characters (leading, trailing) from the 'Account(Customer_Name)' column, we can use .str.strip():

In [37]:
# Create a boolean mask to check for leading or trailing white spaces
mask = df['OSC Account Name'].str.strip() != df['OSC Account Name']

# Use the mask to filter and print the rows with extra white spaces
rows_with_extra_spaces = df[mask]
rows_with_extra_spaces

,CDB ID,OSC Account Name,Country Name,FY24 Account Segmentation,DAAL NB
4,7434745,"ALLIANZ TECHNOLOGY OF AMERICA, INC.",US,Segment 2,ALLIANZ
8,11670,"SUPERIOR COURT OF CALIFORNIA,VENTURA COUNTY",US,Longtail,COUNTY OF VENTURA CA
12,2470066,AMERICAN BEEF SA DE CV,MX,Longtail,AMERICAN BEEF
13,2463882,BTG PACTUAL CASA DE BOLSA SA DE CV,MX,Longtail,BTG PACTUAL MEXICO
14,472954,CS RECURSOS GEOTÉRMICO ICE,CR,Longtail,C S RECURSOS GEOTERMICO I C E
...,...,...,...,...,...
204743,564177,IEOC EXPLORATION B.V,EG,Segment 3,IEOC EXPLORATION B.V
206620,NaN,OPUS TIGÁZ Zrt.,HU,Longtail,OPUS TIGÁZ ZRT.
206621,NaN,OPUS TITÁSZ Zrt.,HU,Longtail,OPUS TITÁSZ ZRT.
223831,NaN,CHILDREN AND FAMILY COURTS ADVISORY AND SUPPOR...,GB,Segment 2,MINISTRY OF JUSTICE
225612,1572894,CHESLYN HAY SPORTS & COMMUNITY HIGH SCHOOL,GB,Segment 4,UKI COLLEGES UNIVERSITIES AND PROFESSIONAL SCH...

In [38]:
df['OSC Account Name'] = df['OSC Account Name'].str.strip()

In [39]:
# Create a boolean mask to check for leading or trailing white spaces
mask = df['OSC Account Name'].str.strip() != df['OSC Account Name']

# Use the mask to filter and print the rows with extra white spaces
rows_with_extra_spaces = df[mask]
rows_with_extra_spaces

Empty DataFrame
Columns: [CDB ID, OSC Account Name, Country Name, FY24 Account Segmentation, DAAL NB]
Index: []

In [40]:
df['DAAL NB'] = df['DAAL NB'].str.strip()

## Remove UMLAUT Characters:
If you want to remove UMLAUT characters like "ü," you can use Python's unidecode library to convert them to their closest ASCII equivalent:

### Use the unidecode function to transliterate Umlaut characters in the 'Account(Customer_Name)' column
### This code will replace Umlaut characters with their closest English alphabet equivalents. For example, "ü" will be replaced with "u," "ä" with "a," and "ö" with "o."

In [41]:
pip install unidecode

Defaulting to user installation because normal site-packages is not writeable
Collecting unidecode
  Downloading Unidecode-1.3.7-py3-none-any.whl (235 kB)
                                              0.0/235.5 kB ? eta -:--:--
     -----                                   30.7/235.5 kB 1.3 MB/s eta 0:00:01
     ---------                             61.4/235.5 kB 656.4 kB/s eta 0:00:01
     --------------                        92.2/235.5 kB 871.5 kB/s eta 0:00:01
     ------------------                   122.9/235.5 kB 722.1 kB/s eta 0:00:01
     --------------------------           174.1/235.5 kB 748.1 kB/s eta 0:00:01
     ----------------------------------   225.3/235.5 kB 808.4 kB/s eta 0:00:01
     ------------------------------------ 235.5/235.5 kB 801.6 kB/s eta 0:00:00
Installing collected packages: unidecode
Successfully installed unidecode-1.3.7
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.1.2 -> 23.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [42]:
from unidecode import unidecode

In [43]:
# Create a boolean mask to check for Umlaut characters
mask = df['OSC Account Name'].apply(lambda x: x != unidecode(x))

# Use the mask to filter and print the rows with Umlaut characters
rows_with_umlaut = df[mask]
rows_with_umlaut

,CDB ID,OSC Account Name,Country Name,FY24 Account Segmentation,DAAL NB
14,472954,CS RECURSOS GEOTÉRMICO ICE,CR,Longtail,C S RECURSOS GEOTERMICO I C E
27,663876,0GARIB INFORMÁTICA E ELETRONICA LTDA,BR,Longtail,0GARIB INFORMÃÂTICA E ELETRONICA LTDA
130,1644694,24 7 INTELIGÊNCIA DIGITAL LTDA,BR,Longtail,24 7 INTELIGÃÂNCIA DIGITAL LTDA
137,1647387,26 TABELIÃO DE NOTAS DA CAPITAL,BR,Longtail,26 TABELIÃÂO DE NOTAS DA CAPITAL
148,612408,2MI TECNOLGOIA E INFORMÁTICA,BR,Longtail,2MI TECNOLGOIA E INFORMÃÂTICA
...,...,...,...,...,...
228391,1420624,ST PETER’S C OF E PRIMARY SCHOOL,GB,Segment 4,UKI ELEMENTARY AND SECONDARY SCHOOLS
228392,7298641,ST PETER’S PRIMARY SCHOOL,GB,Segment 4,UKI ELEMENTARY AND SECONDARY SCHOOLS
228393,79292,ST PETERÂ€™S CE (A) FIRST SCHOOL,GB,Segment 4,UKI ELEMENTARY AND SECONDARY SCHOOLS
228405,646364,ST STEPHEN’S PRIMARY SCHOOL,GB,Segment 4,UKI ELEMENTARY AND SECONDARY SCHOOLS
228419,337559,ST THOMAS’ CE PRIMARY SCHOOL,GB,Segment 4,UKI ELEMENTARY AND SECONDARY SCHOOLS

In [44]:
df['OSC Account Name'] = df['OSC Account Name'].apply(unidecode)

In [45]:
# Create a boolean mask to check for Umlaut characters
mask = df['OSC Account Name'].apply(lambda x: x != unidecode(x))

# Use the mask to filter and print the rows with Umlaut characters
rows_with_umlaut = df[mask]
rows_with_umlaut

Empty DataFrame
Columns: [CDB ID, OSC Account Name, Country Name, FY24 Account Segmentation, DAAL NB]
Index: []

In [46]:
# Create a boolean mask to check for Umlaut characters
mask = df['DAAL NB'].apply(lambda x: x != unidecode(x))

# Use the mask to filter and print the rows with Umlaut characters
rows_with_umlaut = df[mask]
rows_with_umlaut

,CDB ID,OSC Account Name,Country Name,FY24 Account Segmentation,DAAL NB
15,5874935,ESCUELA SUPERIOR DE ARTES DE YUCATAN,MX,Longtail,ÃÂ ESCUELA SUPERIOR DE ARTES DE YUCATAN
16,1259324,MILLINGTON FIRST BAPTIST CHURCH,US,Longtail,ÃÂ MILLINGTON FIRST BAPTIST CHURCH
17,574225,PROALCO SAS,CO,Longtail,ÃÂ PROALCO SAS
27,663876,0GARIB INFORMATICA E ELETRONICA LTDA,BR,Longtail,0GARIB INFORMÃÂTICA E ELETRONICA LTDA
130,1644694,24 7 INTELIGENCIA DIGITAL LTDA,BR,Longtail,24 7 INTELIGÃÂNCIA DIGITAL LTDA
...,...,...,...,...,...
224201,2618911,NURNBERGER ALLGEMEINE VERSICHERUNGS AG,DE,Segment 2,NÜRNBERGER BETEILIGUNGS-AG
224202,1429950,NURNBERGER ALLGEMEINE VERSICHERUNGS-AG,DE,Segment 2,NÜRNBERGER BETEILIGUNGS-AG
224203,1173167,NURNBERGER LEBENSVERSICHERUNG AG,DE,Segment 2,NÜRNBERGER BETEILIGUNGS-AG
224204,6762722,NURNBERGER VERSICHERUNG,DE,Segment 2,NÜRNBERGER BETEILIGUNGS-AG
224205,6832979,SCHORGHUBER CORPORATE IT GMBH,DE,Segment 2,SCHÖRGHUBER UNTERNEHMENSGRUPPE (SUG)

In [47]:
df['DAAL NB'] = df['DAAL NB'].apply(unidecode)

In [48]:
# Create a boolean mask to check for Umlaut characters
mask = df['DAAL NB'].apply(lambda x: x != unidecode(x))

# Use the mask to filter and print the rows with Umlaut characters
rows_with_umlaut = df[mask]
rows_with_umlaut

Empty DataFrame
Columns: [CDB ID, OSC Account Name, Country Name, FY24 Account Segmentation, DAAL NB]
Index: []

## Remove Stop Words:
### To remove stop words, you'll need to define a list of stop words and then filter them out from the 'OSC Account Name' column:

In [49]:
# Convert 'Name' column values to uppercase
df['OSC Account Name'] = df['OSC Account Name'].str.upper()

In [50]:
df['OSC Account Name'] = df['OSC Account Name'].str.replace('[.,-]', '', regex=True)
df['DAAL NB'] = df['DAAL NB'].str.replace('[.,-]', '', regex=True)

In [51]:
stop_words = [".",",","PVT","PRIVATE", "LIMITED",'PLC',"and", "THE","INC",'CO','COLTD','LTD','SA', 'S/A','PTE','BHD','CORP','CORPORATION','S', 'DE', 'RL',
              'DE', 'CV','&','COMPANY', 'LTDA','LLC',...]  # Add more stop words as needed

# Remove stop words from the 'Account(Customer_Name)' column
df['OSC Account Name'] = df['OSC Account Name'].apply( lambda x: ' '.join([word for word in x.split() if word not in stop_words]) )

In [52]:
# Remove stop words from the 'Account(Customer_Name)' column
df['DAAL NB'] = df['DAAL NB'].apply( lambda x: ' '.join([word for word in x.split() if word not in stop_words]) )

In [53]:
# Find the row with CDB_ID == 12345
specific_row = df[df['CDB ID'] == 7434745]
specific_row

Empty DataFrame
Columns: [CDB ID, OSC Account Name, Country Name, FY24 Account Segmentation, DAAL NB]
Index: []

In [54]:
# Find the row with CDB_ID == 12345
specific_row = df[df['CDB ID'] == 1142871]
specific_row

Empty DataFrame
Columns: [CDB ID, OSC Account Name, Country Name, FY24 Account Segmentation, DAAL NB]
Index: []

In [55]:
df

,CDB ID,OSC Account Name,Country Name,FY24 Account Segmentation,DAAL NB
0,7425027,1976,PE,Longtail,1976
1,523314,37135,DO,Longtail,37135
2,1080194,44988,AR,Longtail,44258
3,7561885,50624412411,CR,Longtail,50624412411
4,7434745,ALLIANZ TECHNOLOGY OF AMERICA,US,Segment 2,ALLIANZ
...,...,...,...,...,...
229645,7568158,WREXHAM COUNCIL,GB,Segment 4,UKI COUNCIL
229646,647360,WYCHAVON DISTRICT COUNCIL,GB,Segment 4,UKI COUNCIL
229649,1316172,WYCOMBE DISTRICT COUNCIL,GB,Segment 4,UKI COUNCIL
229650,1473192,WYRE BOROUGH COUNCIL,GB,Segment 4,UKI COUNCIL
229651,956771,WYRE FOREST DISTRICT COUNCIL,GB,Segment 4,UKI COUNCIL

In [56]:
# Check for duplicate rows without considering the 'CDB ID' column
columns_to_check = ['OSC Account Name', 'Country Name', 'FY24 Account Segmentation', 'DAAL NB']
duplicate_rows = df.duplicated(subset=columns_to_check, keep='first')

# Count the number of duplicate rows
num_duplicates = duplicate_rows.sum()

print(f"Number of duplicate rows: {num_duplicates}")

Number of duplicate rows: 7169

In [57]:
# Filter and print the duplicate rows
duplicate_df = df[duplicate_rows]
print("Duplicate rows without considering 'CDB ID' column:")
duplicate_df

Duplicate rows without considering 'CDB ID' column:

,CDB ID,OSC Account Name,Country Name,FY24 Account Segmentation,DAAL NB
105,1152296,20 20 FINANCIAL CONSULTING,US,Longtail,20/20 FINANCIAL CONSULTING
204,384758,3M,US,Segment 3,3M
312,2510275,7 ELEVEN MEXICO,MX,Segment 3,7 ELEVEN
346,61892,99 CENTS ONLY STORES,US,Longtail,99 CENTS ONLY STORES
354,835401,9TH CIRCUIT COURT,US,Segment 1,US COURTS
...,...,...,...,...,...
228559,1160687,HOLLINS TECHNOLOGY COLLEGE,GB,Segment 4,UKI ELEMENTARY AND SECONDARY SCHOOLS
228566,593976,KINGS SCHOOL,GB,Segment 4,UKI ELEMENTARY AND SECONDARY SCHOOLS
228600,1521703,SWANAGE SCHOOL,GB,Segment 4,UKI ELEMENTARY AND SECONDARY SCHOOLS
229354,956442,PENNINE ACUTE HOSPITALS NHS TRUST,GB,Segment 4,UKI NATIONAL HEALTH SERVICE (NHS)
229392,6756541,WRIGHTINGTON WIGAN LEIGH NHS,GB,Segment 4,UKI NATIONAL HEALTH SERVICE (NHS)

In [58]:
df.shape

(134227, 5)

In [59]:
# Drop duplicated rows keeping the first occurrence without considering first column
columns_to_check = ['OSC Account Name', 'Country Name', 'FY24 Account Segmentation', 'DAAL NB']

df = df.drop_duplicates(subset=columns_to_check, keep='first')

In [60]:
df.shape

(127058, 5)

In [61]:
df.to_csv('../output/cleaned_daal2.csv', index=False)